app/controllers/articulos_controller.rb

  def create
    @articulo = Articulo.new(articulo_params)

    respond_to do |format|
      if @articulo.save
---
INSERT INTO "articulos" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "a1"], ["price", 1222], ["created_at", "2015-10-22 20:33:23.954646"], ["updated_at", "2015-10-22 20:33:23.954646"]]

    def set_articulo
      @articulo = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT 1  [["id", 1]]